In [2]:
import pandas as pd
import numpy as np


dates = pd.date_range("20250101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2025-01-01 -0.444373 -0.530267  0.546135  0.423311
2025-01-02  1.602635 -0.850973 -0.625099  1.085254
2025-01-03 -0.157418  0.765305  0.898202 -0.655864
2025-01-04 -1.204486  0.408196  0.300444  1.268260
2025-01-05 -0.710879 -2.107949  0.208251  0.514181
2025-01-06  0.203390 -1.479070  0.301330  0.664145

In [3]:
df1 = df.reindex(index=dates[0: 4], columns=list(df.columns) + ['E'])
df1.iloc[0:2,4] = 1
df1

                   A         B         C         D    E
2025-01-01 -0.444373 -0.530267  0.546135  0.423311  1.0
2025-01-02  1.602635 -0.850973 -0.625099  1.085254  1.0
2025-01-03 -0.157418  0.765305  0.898202 -0.655864  NaN
2025-01-04 -1.204486  0.408196  0.300444  1.268260  NaN

In [4]:
df1.dropna()

                   A         B         C         D    E
2025-01-01 -0.444373 -0.530267  0.546135  0.423311  1.0
2025-01-02  1.602635 -0.850973 -0.625099  1.085254  1.0

In [5]:
df1.fillna(5)

                   A         B         C         D    E
2025-01-01 -0.444373 -0.530267  0.546135  0.423311  1.0
2025-01-02  1.602635 -0.850973 -0.625099  1.085254  1.0
2025-01-03 -0.157418  0.765305  0.898202 -0.655864  5.0
2025-01-04 -1.204486  0.408196  0.300444  1.268260  5.0

In [6]:
s = pd.Series([1, 3, 1, np.nan, 6, 8], index=dates).shift(2)
s

2025-01-01    NaN
2025-01-02    NaN
2025-01-03    1.0
2025-01-04    3.0
2025-01-05    1.0
2025-01-06    NaN
Freq: D, dtype: float64

In [7]:
df

                   A         B         C         D
2025-01-01 -0.444373 -0.530267  0.546135  0.423311
2025-01-02  1.602635 -0.850973 -0.625099  1.085254
2025-01-03 -0.157418  0.765305  0.898202 -0.655864
2025-01-04 -1.204486  0.408196  0.300444  1.268260
2025-01-05 -0.710879 -2.107949  0.208251  0.514181
2025-01-06  0.203390 -1.479070  0.301330  0.664145

In [8]:
df.sub(s, axis="index")

                   A         B         C         D
2025-01-01       NaN       NaN       NaN       NaN
2025-01-02       NaN       NaN       NaN       NaN
2025-01-03 -1.157418 -0.234695 -0.101798 -1.655864
2025-01-04 -4.204486 -2.591804 -2.699556 -1.731740
2025-01-05 -1.710879 -3.107949 -0.791749 -0.485819
2025-01-06       NaN       NaN       NaN       NaN

In [9]:
df

                   A         B         C         D
2025-01-01 -0.444373 -0.530267  0.546135  0.423311
2025-01-02  1.602635 -0.850973 -0.625099  1.085254
2025-01-03 -0.157418  0.765305  0.898202 -0.655864
2025-01-04 -1.204486  0.408196  0.300444  1.268260
2025-01-05 -0.710879 -2.107949  0.208251  0.514181
2025-01-06  0.203390 -1.479070  0.301330  0.664145

In [10]:
df.A.transform(lambda x: x*100)

2025-01-01    -44.437326
2025-01-02    160.263524
2025-01-03    -15.741751
2025-01-04   -120.448611
2025-01-05    -71.087883
2025-01-06     20.338953
Freq: D, Name: A, dtype: float64

In [11]:
df.agg(lambda x: np.mean(x) * 100)

A   -11.852182
B   -63.245944
C    27.154392
D    54.988114
dtype: float64

In [12]:
pd.concat([df, df]).value_counts()

A          B          C          D
-1.204486   0.408196   0.300444   1.268260    2
-0.710879  -2.107949   0.208251   0.514181    2
-0.444373  -0.530267   0.546135   0.423311    2
-0.157418   0.765305   0.898202  -0.655864    2
 0.203390  -1.479070   0.301330   0.664145    2
 1.602635  -0.850973  -0.625099   1.085254    2
Name: count, dtype: int64

In [13]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [14]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [15]:
df1 = df.copy(deep=True)
df1.columns = df.columns.str.lower()
df1

                   a         b         c         d
2025-01-01 -0.444373 -0.530267  0.546135  0.423311
2025-01-02  1.602635 -0.850973 -0.625099  1.085254
2025-01-03 -0.157418  0.765305  0.898202 -0.655864
2025-01-04 -1.204486  0.408196  0.300444  1.268260
2025-01-05 -0.710879 -2.107949  0.208251  0.514181
2025-01-06  0.203390 -1.479070  0.301330  0.664145

In [16]:
df.join(df1)

,A,B,C,D,a,b,c,d
2025-01-01,-0.444373,-0.530267,0.546135,0.423311,-0.444373,-0.530267,0.546135,0.423311
2025-01-02,1.602635,-0.850973,-0.625099,1.085254,1.602635,-0.850973,-0.625099,1.085254
2025-01-03,-0.157418,0.765305,0.898202,-0.655864,-0.157418,0.765305,0.898202,-0.655864
2025-01-04,-1.204486,0.408196,0.300444,1.268260,-1.204486,0.408196,0.300444,1.268260
2025-01-05,-0.710879,-2.107949,0.208251,0.514181,-0.710879,-2.107949,0.208251,0.514181
2025-01-06,0.203390,-1.479070,0.301330,0.664145,0.203390,-1.479070,0.301330,0.664145

In [17]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})

left.merge(right, on='key', how='inner')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [18]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],"k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [19]:
data[~data.k1.duplicated()]

    k1  k2
0  one   1
1  two   1

In [20]:
data.drop_duplicates('k1', keep='last')

    k1  k2
4  one   3
6  two   4

In [21]:
class Solution:
    def maxSubArray(self, nums: list[int]) -> int:
        res = float('-inf')
        curr = 0
        for n in nums:
            curr = max(0, curr+n)
            curr += n
            res = max(curr, res)
        
        return res

In [22]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [23]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8